---
kind: property
id: P:Autodesk.Revit.DB.AssemblyDifferenceNamingCategory.NamingCategoryId1
source: html/a26eccfe-27f6-e78c-4889-2be7f3c8f420.htm
---
# Autodesk.Revit.DB.AssemblyDifferenceNamingCategory.NamingCategoryId1 Property

Naming category id of the first assembly

## Syntax (C#)
```csharp
public ElementId NamingCategoryId1 { get; }
```